In [1]:
import pandas as pd

# case1

In [2]:
df=pd.DataFrame(['Ab123','Cd456','Ef789'],columns=['col1'])

In [3]:
df

    col1
0  Ab123
1  Cd456
2  Ef789

In [4]:
df['alphabets'] = df.col1.str.extract('([A-Z][a-z]\w{0})', expand=True)
df['numeric'] = df.col1.str.extract('(\d+)', expand=True)

In [5]:
df

    col1 alphabets numeric
0  Ab123        Ab     123
1  Cd456        Cd     456
2  Ef789        Ef     789

In [6]:
df.drop('col1',axis=1,inplace=True)

In [7]:
df

  alphabets numeric
0        Ab     123
1        Cd     456
2        Ef     789

# case2

In [8]:
data=pd.DataFrame(['AB 123','CD 456','EF 789'],columns=['col1'])

In [9]:
data

     col1
0  AB 123
1  CD 456
2  EF 789

In [10]:
df2=data['col1'].str.split(' ',expand=True)

In [11]:
df2

    0    1
0  AB  123
1  CD  456
2  EF  789

In [12]:
df2.rename(columns={0:'alphabets',1:'numeric'})

  alphabets numeric
0        AB     123
1        CD     456
2        EF     789

# splitting an address

In [13]:
df=pd.DataFrame(['345th ave street,church road,btm layout,banglore,karnataka,500136'],columns=['address'])

In [14]:
df

                                             address
0  345th ave street,church road,btm layout,banglo...

In [15]:
df=df['address'].str.split(',',expand=True)

In [16]:
df

                  0            1           2         3          4       5
0  345th ave street  church road  btm layout  banglore  karnataka  500136

In [17]:
df.rename(columns={0:'street',1:'road',2:'layout',3:'city',4:'state',5:'pincode'})

             street         road      layout      city      state pincode
0  345th ave street  church road  btm layout  banglore  karnataka  500136

# splitting an datetime - 1

In [18]:
df = pd.DataFrame({'datetime':pd.date_range('2020-01-01 07:00',periods=6,freq='D')})

In [19]:
df

             datetime
0 2020-01-01 07:00:00
1 2020-01-02 07:00:00
2 2020-01-03 07:00:00
3 2020-01-04 07:00:00
4 2020-01-05 07:00:00
5 2020-01-06 07:00:00

In [20]:
df['date'] = df['datetime'].dt.day
df['month'] = df['datetime'].dt.month
df['year'] = df['datetime'].dt.year
df['hour'] = df['datetime'].dt.hour
df['minute'] = df['datetime'].dt.minute
df['seconds'] = df['datetime'].dt.second

In [21]:
df

             datetime  date  month  year  hour  minute  seconds
0 2020-01-01 07:00:00     1      1  2020     7       0        0
1 2020-01-02 07:00:00     2      1  2020     7       0        0
2 2020-01-03 07:00:00     3      1  2020     7       0        0
3 2020-01-04 07:00:00     4      1  2020     7       0        0
4 2020-01-05 07:00:00     5      1  2020     7       0        0
5 2020-01-06 07:00:00     6      1  2020     7       0        0

In [22]:
df.drop('datetime',axis=1,inplace=True)

In [23]:
df

   date  month  year  hour  minute  seconds
0     1      1  2020     7       0        0
1     2      1  2020     7       0        0
2     3      1  2020     7       0        0
3     4      1  2020     7       0        0
4     5      1  2020     7       0        0
5     6      1  2020     7       0        0

# splitting an datetime - 2 (using pd.to_datetime)

In [24]:
df1 = pd.DataFrame({'datetime':pd.date_range('2015-01-10 07:25:45',periods=6,freq='M')})

In [25]:
df1

             datetime
0 2015-01-31 07:25:45
1 2015-02-28 07:25:45
2 2015-03-31 07:25:45
3 2015-04-30 07:25:45
4 2015-05-31 07:25:45
5 2015-06-30 07:25:45

In [26]:
df1["date"] = pd.to_datetime(df1.datetime, format="%d/%m/%Y").dt.day
df1["month"] = pd.to_datetime(df1.datetime, format="%d/%m/%Y").dt.month
df1["year"] = pd.to_datetime(df1.datetime, format="%d/%m/%Y").dt.year
df1["hour"] = pd.to_datetime(df1.datetime, format="%d/%m/%Y").dt.hour
df1["minute"] = pd.to_datetime(df1.datetime, format="%d/%m/%Y").dt.minute
df1["second"] = pd.to_datetime(df1.datetime, format="%d/%m/%Y").dt.second

In [27]:
df1

             datetime  date  month  year  hour  minute  second
0 2015-01-31 07:25:45    31      1  2015     7      25      45
1 2015-02-28 07:25:45    28      2  2015     7      25      45
2 2015-03-31 07:25:45    31      3  2015     7      25      45
3 2015-04-30 07:25:45    30      4  2015     7      25      45
4 2015-05-31 07:25:45    31      5  2015     7      25      45
5 2015-06-30 07:25:45    30      6  2015     7      25      45

In [28]:
df1.drop('datetime',axis=1,inplace=True)
df1

   date  month  year  hour  minute  second
0    31      1  2015     7      25      45
1    28      2  2015     7      25      45
2    31      3  2015     7      25      45
3    30      4  2015     7      25      45
4    31      5  2015     7      25      45
5    30      6  2015     7      25      45